Wiz-IO/framework-wizio-cc/arduino/libraries/CC2652/OT_RADIO/ot_radio.c
exit:
    return;
}

/**
 * Function documented in platform/radio.h
 *
 * @note it is entirely possible for this function to fail, but there is no
 * valid way to return that error since the function prototype was changed.
 */
void otPlatRadioSetExtendedAddress(const otExtAddress *aAddress)
{

    /* XXX: assuming little endian format */
    if (sState == cc2652_stateReceive)
    {
        otEXPECT(rfCoreExecuteAbortCmd() == CMDSTA_Done);
        sReceiveCmd.localExtAddr = otEncodingReadUint64Le(aAddress->m8);
        otEXPECT(rfCoreClearReceiveQueue(&sRxDataQueue) == CMDSTA_Done);
        otEXPECT(rfCoreSendReceiveCmd() == CMDSTA_Done);
        /* the interrupt from abort changed our state to sleep */
        sState = cc2652_stateReceive;
    }
    else if (sState != cc2652_stateTransmit)
    {
        sReceiveCmd.localExtAddr = otEncodingReadUint64Le(aAddress->m8);
    }

exit:
    return;
}

/**
 * Function documented in platform/radio.h
 *
 * @note it is entirely possible for this function to fail, but there is no
 * valid way to return that error since the function prototype was changed.
 */
void otPlatRadioSetShortAddress(uint16_t aAddress)
{

    if (sState == cc2652_stateReceive)
    {
        otEXPECT(rfCoreExecuteAbortCmd() == CMDSTA_Done);
        sReceiveCmd.localShortAddr = aAddress;
        otEXPECT(rfCoreClearReceiveQueue(&sRxDataQueue) == CMDSTA_Done);
        otEXPECT(rfCoreSendReceiveCmd() == CMDSTA_Done);
        /* the interrupt from abort changed our state to sleep */
        sState = cc2652_stateReceive;
    }
    else if (sState != cc2652_stateTransmit)
    {
        sReceiveCmd.localShortAddr = aAddress;
    }

exit:
    return;
}

static void cc2652RadioProcessTransmitDone(
    otRadioFrame *aTransmitFrame,
    otRadioFrame *aAckFrame,
    otError aTransmitError)
{
#if OPENTHREAD_CONFIG_DIAG_ENABLE

    if (otPlatDiagModeGet())
    {
        otPlatDiagRadioTransmitDone(aTransmitFrame, aTransmitError);
    }
    else
#endif /* OPENTHREAD_CONFIG_DIAG_ENABLE */
    {
        otPlatRadioTxDone(aTransmitFrame, aAckFrame, aTransmitError);
    }
}

static void cc2652RadioProcessReceiveDone(otRadioFrame *aReceiveFrame, otError aReceiveError)
{
    // TODO Set this flag only when the packet is really acknowledged with frame pending set.
    // See https://github.com/openthread/openthread/pull/3785
    aReceiveFrame->mInfo.mRxInfo.mAckedWithFramePending = true;
#if OPENTHREAD_CONFIG_DIAG_ENABLE

    if (otPlatDiagModeGet())
    {
        otPlatDiagRadioReceiveDone(aReceiveFrame, aReceiveError);
    }
    else
#endif /* OPENTHREAD_CONFIG_DIAG_ENABLE */
    {
        otPlatRadioReceiveDone(aReceiveFrame, aReceiveError);
    }
}

static void cc2652RadioProcessReceiveQueue(void)
{
    rfc_ieeeRxCorrCrc_t *crcCorr;
    rfc_dataEntryGeneral_t *curEntry, *startEntry;
    uint8_t rssi;

    startEntry = (rfc_dataEntryGeneral_t *)sRxDataQueue.pCurrEntry;
    curEntry = startEntry;

    /* loop through receive queue */
    do
    {
        uint8_t *payload = &(curEntry->data);

        if (curEntry->status == DATA_ENTRY_FINISHED)
        {
            uint8_t len;
            otError receiveError;
            otRadioFrame receiveFrame;

            /* get the information appended to the end of the frame.
             * This array access looks like it is a fencepost error, but the
             * first byte is the number of bytes that follow.
             */
            len = payload[0];
            crcCorr = (rfc_ieeeRxCorrCrc_t *)&payload[len];
            rssi = payload[len - 1];

            if (crcCorr->status.bCrcErr == 0 && (len - 2) < OT_RADIO_FRAME_MAX_SIZE)
            {
#if OPENTHREAD_CONFIG_TIME_SYNC_ENABLE
#error Time sync requires the timestamp of SFD rather than that of rx done!
#else
                if (otPlatRadioGetPromiscuous())
#endif
                {
                    // TODO: Propagate CM0 timestamp
                    // The current driver only supports milliseconds resolution.
                    receiveFrame.mInfo.mRxInfo.mTimestamp = otPlatAlarmMilliGetNow() * 1000;
                }

                receiveFrame.mLength = len;
                receiveFrame.mPsdu = &(payload[1]);
                receiveFrame.mChannel = sReceiveCmd.channel;
                receiveFrame.mInfo.mRxInfo.mRssi = rssi;
                receiveFrame.mInfo.mRxInfo.mLqi = crcCorr->status.corr;

                receiveError = OT_ERROR_NONE;
            }
            else
            {
                receiveError = OT_ERROR_FCS;
            }

            if ((receiveFrame.mPsdu[0] & IEEE802154_FRAME_TYPE_MASK) == IEEE802154_FRAME_TYPE_ACK)
            {
                if (sState == cc2652_stateTransmit && sTxCmdChainDone &&
                    receiveFrame.mPsdu[IEEE802154_DSN_OFFSET] == sTransmitFrame.mPsdu[IEEE802154_DSN_OFFSET])
                {
                    /* we found the ACK packet */
                    sState = cc2652_stateReceive;
                    cc2652RadioProcessTransmitDone(&sTransmitFrame, &receiveFrame, receiveError);

                    sTransmitError = OT_ERROR_NONE;
                    sTxCmdChainDone = false;
                }
            }
            else
            {
                cc2652RadioProcessReceiveDone(&receiveFrame, receiveError);
            }

            curEntry->status = DATA_ENTRY_PENDING;
            break;
        }
        else if (curEntry->status == DATA_ENTRY_UNFINISHED)
        {
            curEntry->status = DATA_ENTRY_PENDING;
        }

        curEntry = (rfc_dataEntryGeneral_t *)(curEntry->pNextEntry);
    } while (curEntry != startEntry);
}

/**
 * Function documented in platform-cc2652.h
 */
void cc2652RadioProcess(void)
{
    if (sState == cc2652_stateEdScan)
    {
        if (sEdScanCmd.status == IEEE_DONE_OK)
        {
            otPlatRadioEnergyScanDone(sEdScanCmd.maxRssi);
        }
        else if (sEdScanCmd.status == ACTIVE)
        {
            otPlatRadioEnergyScanDone(CC2652_INVALID_RSSI);
        }
    }

    if (sState == cc2652_stateReceive || sState == cc2652_stateTransmit)
    {
        cc2652RadioProcessReceiveQueue();
    }

    if (sTxCmdChainDone)
    {
        if (sState == cc2652_stateTransmit)
        {
            /* we are not looking for an ACK packet, or failed */
            sState = cc2652_stateReceive;
            cc2652RadioProcessTransmitDone(&sTransmitFrame, NULL, sTransmitError);
        }

        sTransmitError = OT_ERROR_NONE;
        sTxCmdChainDone = false;
    }
}

int8_t otPlatRadioGetReceiveSensitivity(void)
{

    return CC2652_RECEIVE_SENSITIVITY;
}